#+title: Tilfældige tal
#+subtitle: Programmering B
#+options: toc:nil timestamp:nil ^:{}

** randrange
~randrange~ er en af de simpleste måder at få et tilfældigt heltal på. Herer nogle eksempler på anvendelse af ~randrange~.

Fra pythondokumentationen står der følgende om ~randrang~:

#+begin_example
random.randrange(stop)
random.randrange(start, stop[, step])
#+end_example
~stop~ angiver den øverste grænse. Værdien er lige præcis ikke med i intervallet.
~start~ angiver den nederste grænse. Værdien er med i intervallet.
~step~ er ikke obligatorisk. Hvis den er med angiver det stepsize. 

#+begin_src python :exports both :results output :eval never-export
import random
# Tilfældigt heltal fra nul til lige inden 10. Der kan altså vælges mellem 10 forskellige tal
a = random.randrange(10)
print(f"a = {a}")
# Tilfældigt heltal fra og med en startværdi til lige inden en slutværdi
b = random.randrange(2, 5) # b kan altså kun være 2, 3 og 4
print(f"b = {b}")
# Tilfældigt heltal i et interval med en skridtlængde forskellig fra 1
c = random.randrange(2, 23, 4) # c kan antage værdierne 2, 6, 10, 14, 18 og 22
print(f"c = {c}")
#+end_src

#+RESULTS:
#+begin_example
a = 4
b = 4
c = 18
#+end_example



** randint
~randint~ er et alias for ~randrange(start, stop+1)~, altså hvor begge ender i intervallet er med som muligheder.

Hvis de to første eksempler fra den tidligere viste kode, skal skrives vha ~randint~, så ser den således ud:

#+begin_src python :exports both :results output :eval never-export
import random
# Tilfældigt heltal fra nul til og med 9. Der kan altså vælges mellem 10 forskellige tal
a = random.randint(0, 9)
print(f"a = {a}")
# Tilfældigt heltal fra og med en startværdi til lige inden en slutværdi
b = random.randint(2, 4) # b kan altså kun være 2, 3 og 4
print(f"b = {b}")
#+end_src

#+RESULTS:
#+begin_example
a = 5
b = 2
#+end_example


** random
~random.random()~ giver tilfældige kommatal fra og med 0 til lige inden 1.0. Skrevet som et matematisk interval er det =[0 , 1[=.

#+begin_src python :exports both :results output :eval never-export
import random
for _ in range(10):
    print(random.random())
#+end_src

#+RESULTS:
#+begin_example
0.8150913606464288
0.07397052353932554
0.005883678485159027
0.34220314659519935
0.1842690851371448
0.6286296902960742
0.26424084433250017
0.9472427608922108
0.4906632362023625
0.9932488611078196
#+end_example

** uniform
~random.uniform~ kan give returnere tilfældige kommatal i et interval, hvor sandsynligheden er lige stor for alle decimaltallene.

#+begin_src python :exports both :results output :eval never-export
import random
for _ in range(10):
    print(random.uniform(2.5, 17.5))
#+end_src

#+RESULTS:
#+begin_example
17.00579055310127
4.490579245408291
15.001201757818208
3.2451765219566013
16.059751592714623
7.663094944290456
4.931070601203658
6.618548868430212
10.185962047007152
11.134883919228598
#+end_example


